{
  "data": [
    {
      "id": 1,
      "desc": "Participe en la construcción de un sitio para monitorear las casuísticas en el IMSS, mis responsabilidades en el proyecto eran aplicar optimizaciones a las consultas de MongoDB en los microservicios construidos con Java Spring y de esta manera disminuir el tiempo de respuesta de las peticiones, además participé en la optimización de componentes y construcción de nuevos para mejorar la funcionalidad del sitio Web desarrollado en Angular.",
      "period": "Septiembre 2020 – Actualidad",
      "job": "Full Stack Developer",
      "company": "Softtek"
    },
    {
      "id": 2,
      "desc": "Desarrolle una SPA con Angular para administrar condominios, realice las definiciones de la arquitectura tales como los componentes reutilizables, la estrategia de ruteo, el manejo del estado, las pruebas unitarias, la configuración de los diferentes ambientes para la aplicación y la integración de la API. Por otro lado, implemente las notificaciones push tanto en el backend como en el frontend utilizando firebase y websockets para esto. También estuve activamente desarrollando y haciendo mejoras a los microservicios.",
      "period": "Febrero 2020 – Agosto 2020",
      "job": "Full Stack Developer",
      "company": "Yoin",
      "right": true
    },
    {
      "id": 3,
      "desc": "Desarrollar una API rest para la administración de condominios con Java y Spring boot usando mariadb como base de datos y utilizando una arquitectura basada en la nube. Además, desarrolle un chatbot con DialogFlow y lo integre con la API de Slack para obtener la información de los empleados como el nombre, número telefónico, email, días de vacaciones disponibles, etc.",
      "period": "Febrero 2019 – Febrero 2020",
      "job": "Java Developer",
      "company": "Axity"
    },
    {
      "id": 4,
      "desc": "Desarrolle una aplicación para la administración del inventario de la empresa utilizando Java swing e implementando PostgreSQL como base de datos, también trabaje construyendo diagramas eléctricos en AutoCAD, construyendo tableros de control y realizando cotizaciones de materiales.",
      "period": "Junio 2017 – Enero 2019",
      "job": "Project Engineer",
      "company": "Premier Automation International S.A. de C.V.",
      "right": true
    }
  ]
}